### Problem13: pandas delete duplicated & aggregation

In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('data/order_list_with_dup.csv')

##### Step 1: Find the duplicated order data from files
* ###### keep = 'first' => Mark duplicates as True except for the first occurrence.
* ###### keep = 'last' => Mark duplicates as True except for the last occurrence.
* ###### keep = False  => Mark all duplicates as True

In [16]:
dup_data = df[df.duplicated(keep='last')]
dup_data

    shop_id  goods_no               goods_nm customer_name  order_date   price
4       126    183005   Thom Browne Necklace          jane  2022-01-04  724140
7       154    183012  Bottega Veneta Shirts         Burry  2022-01-04  599860
10      126    183005   Thom Browne Necklace          jane  2022-01-04  724140
11       62    183017             Prada Coat          Mike  2021-12-28  625820
24       85    183018     Thom Browne Shirts          jane  2022-01-01  749430

##### Step 2: Find the first order of each shop

In [17]:
first_order = df[~df.duplicated(subset=["shop_id"], keep='first')]
first_order

    shop_id  goods_no               goods_nm customer_name  order_date   price
0       163    183058             Prada Coat          Mike  2021-12-26  674900
1       104    183028        Gucci Accessory         Stark  2022-01-15  102870
2       181    183003         Gucci Necklace          Mike  2022-01-07  576900
3       136    183039     Ferragamo Necklace         Burry  2022-01-08  683100
4       126    183005   Thom Browne Necklace          jane  2022-01-04  724140
5       146    183042   Thom Browne T-Shirts         Stark  2021-12-29  708960
6        24    183038        Ferragamo Pants          Alex  2022-01-06  864780
7       154    183012  Bottega Veneta Shirts         Burry  2022-01-04  599860
8        47    183052   Thom Browne T-Shirts         Stark  2021-12-26  321080
11       62    183017             Prada Coat          Mike  2021-12-28  625820
12       51    183054         Prada T-Shirts          jane  2022-01-04  566100
15       52    183034     Thom Browne Shirts          Alex  2022-01-15  615700
16       86    183025   Bottega Veneta Pants         Stark  2021-12-28  785680
18       12    183016  Bottega Veneta Shirts         Stark  2021-12-29  477960
19       37    183001      Thom Browne Pants          jane  2021-12-30  375830
21       17    183035        Ferragamo Pants          Alex  2022-01-05  928720
22        6    183051   Bottega Veneta Pants         Burry  2022-01-15  280000
24       85    183018     Thom Browne Shirts          jane  2022-01-01  749430
27      190    183023     Thom Browne Shirts          jane  2021-12-31  829010

##### Step 3: Find the first order of each customer

In [18]:
first_order = df[~df.duplicated(subset=["customer_name"], keep='first')]
first_order

   shop_id  goods_no              goods_nm customer_name  order_date   price
0      163    183058            Prada Coat          Mike  2021-12-26  674900
1      104    183028       Gucci Accessory         Stark  2022-01-15  102870
3      136    183039    Ferragamo Necklace         Burry  2022-01-08  683100
4      126    183005  Thom Browne Necklace          jane  2022-01-04  724140
6       24    183038       Ferragamo Pants          Alex  2022-01-06  864780
9      163    183010        Prada Necklace          Tony  2022-01-09  792990

##### Step 4: Get total price and average price of each customer

In [20]:
agg_data = df.groupby('customer_name').agg(total_price=("price", "sum"), avg_price=("price", "mean"))
agg_data

               total_price      avg_price
customer_name
Alex               2409200  803066.666667
Burry              2495320  499064.000000
Mike               3066740  613348.000000
Stark              2396550  479310.000000
Tony               1793270  597756.666667
jane               6269160  626916.000000

##### Step 5: Count the # of unique goods_no for each shop sold

In [42]:
cnt_result = df.groupby("shop_id")["goods_no"].nunique()
cnt_result = cnt_result.reset_index()
cnt_result_with_rename = cnt_result.rename(columns={"goods_no": "unique_goods"})
cnt_result_with_rename

    shop_id  unique_goods
0         6             1
1        12             1
2        17             1
3        24             1
4        37             1
5        47             1
6        51             1
7        52             1
8        62             1
9        85             1
10       86             1
11      104             2
12      126             1
13      136             1
14      146             1
15      154             1
16      163             2
17      181             1
18      190             1

##### Step 6: Find the shop that sold more than 2 different goods

In [44]:
shop_list = cnt_result_with_rename[cnt_result_with_rename["unique_goods"] > 1]
shop_list

    shop_id  unique_goods
11      104             2
16      163             2